---
kind: type
id: T:Autodesk.Revit.DB.BaseImportOptions
source: html/75898e94-cff4-fb64-c613-9596599444c4.htm
---
# Autodesk.Revit.DB.BaseImportOptions

A base class containing import options used during import of several formats.

## Syntax (C#)
```csharp
public class BaseImportOptions : IDisposable
```